taskleaf/app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "fsdfasfasdfasfasdf fsdfasfasdfasfasdf fsdfasfasdfasfasdf"], ["description", "fastfasdf"], ["created_at", "2022-09-15 12:43:07.108175"], ["updated_at", "2022-09-15 12:43:07.108175"]]
---
  def create
    @task = Task.new(task_params)

    if @task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["description", "fasdfasdfafsad"], ["updated_at", "2022-09-04 10:02:43.497406"], ["id", 2]]
---
    task = Task.find(params[:id])
    task.update!(task_params)