scaffold_app/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "address", "age", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "たろう"], ["address", "とうきょう"], ["age", nil], ["created_at", "2022-09-04 04:49:35.009589"], ["updated_at", "2022-09-04 04:49:35.009589"]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "age" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["age", 1], ["updated_at", "2022-09-04 04:49:49.546623"], ["id", 1]]